package Lesson8;


import java.util.Random;

public class HomeTask1 {

    //В отчетном месяце 30 дней. В каждый рассматриваемый день осадки могут или выпасть или не выпасть с одинаковой вероятностью.
    //
    //Составить массив с количеством выпадаемых осадков (от 10 до 50 мм) в день.
    //Из массива, собранного в предыдущем пункте, посчитать в какой период выпадает осадков больше - в начале месяца или в конце
    //Посчитать в какую декаду месяца выпадает осадков больше
    //Когда выпадает осадков больше - в четные дни или в нечетные
    //Посчитать среднее количество осадков на месяц
    //Посчитать среднее количество осадков на "дождливые" дни
    public static void main(String[] args) {

    }
}